org/projects/project-based-org-clocking.org
#+STARTUP: showall indent
#+STARTUP: hidestars
#+BEGIN_HTML
---
layout: post
title: Automating my projects with org-mode
excerpt:
---
#+END_HTML
* Colors
#+BEGIN_SRC emacs-lisp
(defvar org-todo-colors-status-future "MediumSpringGreen")
(defvar org-todo-colors-status-current "DarkOrange1")
(defvar org-todo-colors-status-upcoming "DarkGoldenrod1")
(defvar org-todo-colors-status-urgent "red1")
(defvar org-todo-colors-status-completed "DarkTurquoise")
#+END_SRC

* Projects
Properties are the core object of my time-tracking system. They are how I organize what I can track time against and do billing with. +Unlike other org systems I want to keep my tasks seperate from my top-level project headers. This will allow me to cleanly seperate my projects from a variety of task files that relate to them.+

** Project File
Projects should be stored somewhere. I am going to store them in a central file.

#+BEGIN_SRC emacs-lisp
(defvar org-project-project-file (true-filename "~/.org/projects.org"))
#+END_SRC

** Project Properties
#+BEGIN_EXAMPLE
 *** Project Template
    :PROPERTIES:
    :BILLABLE: (t/f) if the project is billable
    :PERCENT: percent of billable time to use
    :CATEGORY: the major project code to be used for billing purposes
    :START_DATE: start date of project
    :END_DATE: end date of project (when to remove from clocking percent
    :GLOSSARY: The glossary of the key terms of the project for tagging notes and links
    :ID:  the UUID of an object
    :END:
#+END_EXAMPLE

#+BEGIN_SRC emacs-lisp
  (defvar org-project-project-template
  "* %^{Project Stage|ONGOING|IDEA|GLIMMER|CAPTURE|LIVE|KICKOFF|STARTUP|ACTIVE|CLOSEOUT|DONE|CANCELED} %?
  :CONTACTS:\n:END:
  :LOGBOOK:
  - State \"CREATED\"       from \"NONE\"       %U
  :END:
  :PROPERTIES:
  :BILLABLE: %^{Billable?|y|n}
  :PERCENT: %^{Percent of Time}
  :CATEGORY: %^{Project Category}
  :START_DATE:
  :END_DATE:
  :GLOSSARY:
  :ID: %(org-id-uuid)
  :TYPE: project
  :END:"
  "Project Template for org-project")
#+END_SRC

#+BEGIN_SRC emacs-lisp
    (setq org-todo-keyword-faces
          (append org-todo-keyword-faces
                  '(("ONGOING" :foreground org-todo-colors-status-current)
                    ("IDEA" :foreground org-todo-colors-status-future)
                    ("GLIMMER" :foreground org-todo-colors-status-future)
                    ("CAPTURE" :foreground org-todo-colors-status-upcoming :weight bold)
                    ("LIVE" :foreground org-todo-colors-status-upcoming :weight bold)
                    ("KICKOFF" :foreground org-todo-colors-status-urgent :weight bold)
                    ("STARTUP" :foreground org-todo-colors-status-current :weight bold)
                    ("ACTIVE" :foreground org-todo-colors-status-current :weight bold)
                    ("CLOSEOUT" :foreground org-todo-colors-status-urgent :weight bold)
                    ("DONE" :foreground org-todo-colors-status-completed)
                    ("CANCELED" :foreground org-todo-colors-status-completed))
#+END_SRC

** Project States
Projects follow a basic set of project stages so that I can keep track of the progression of a project in the future.
- Ongoing: These are projects that never end. Like fund-raising, administration, etc.
- Idea: This state is saved for ideas for projects that have not yet gelled into full projects, and have no identified funding opportunity.
- Glimmer: These are projects that have are more fleshed out, but only have a possible future funding line identified.
- Capture: These are projects that have an
- Live: When a RFP has dropped and we are exploring the project.
- Kickoff:
- Startup: The actual start up of the project once funding has been received.
- Active: The actual project management portion of the project.
- Closeout: The closeout of the project and sunsetting of technical componenets.

#+BEGIN_SRC emacs-lisp
  (add-to-list 'org-todo-keywords
               '(sequence "ONGOING" "IDEA(!)" "GLIMMER(!)" "CAPTURE(!)" "LIVE(!)" "KICKOFF(!)" "STARTUP(!)" "ACTIVE(!)" "CLOSEOUT(!)" "|" "DONE(d!)" "CANCELED(@!)"))
#+END_SRC

