all/projects/_posts/project-based-org-clocking.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Colors</a></li>
<li><a href="#sec-2">2. Projects</a>
<ul>
<li><a href="#sec-2-1">2.1. Project File</a></li>
<li><a href="#sec-2-2">2.2. Project Properties</a></li>
<li><a href="#sec-2-3">2.3. Project States</a></li>
<li><a href="#sec-2-4">2.4. <span class="todo TODO">TODO</span> Identifying active projects</a></li>
<li><a href="#sec-2-5">2.5. <span class="todo TODO">TODO</span> Project directories and projectile</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Tasks</a>
<ul>
<li><a href="#sec-3-1">3.1. Task File</a></li>
<li><a href="#sec-3-2">3.2. Task helpers</a></li>
<li><a href="#sec-3-3">3.3. Types of tasks</a></li>
<li><a href="#sec-3-4">3.4. Task States</a>
<ul>
<li><a href="#sec-3-4-1">3.4.1. Basic Tasks</a></li>
<li><a href="#sec-3-4-2">3.4.2. Updating a tasks status when states change</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4">4. Events</a>
<ul>
<li><a href="#sec-4-1">4.1. Events File</a></li>
<li><a href="#sec-4-2">4.2. Event Properties</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Email</a>
<ul>
<li><a href="#sec-5-1">5.1. <span class="todo TODO">TODO</span> Received new message</a>
<ul>
<li><a href="#sec-5-1-1">5.1.1. If encrypted</a></li>
<li><a href="#sec-5-1-2">5.1.2. get projects</a></li>
</ul>
</li>
<li><a href="#sec-5-2">5.2. <span class="todo TODO">TODO</span> Open a message</a>
<ul>
<li><a href="#sec-5-2-1">5.2.1. Create an org entry of the email</a></li>
<li><a href="#sec-5-2-2">5.2.2. Add project category to entry from message tag</a></li>
<li><a href="#sec-5-2-3">5.2.3. Start clocking to the message</a></li>
<li><a href="#sec-5-2-4">5.2.4. Create global variable of message that was opened (so that when we stop clocking we don't have to query the original message that opened the thread)</a></li>
<li><a href="#sec-5-2-5">5.2.5. decrypt message</a></li>
</ul>
</li>
<li><a href="#sec-5-3">5.3. <span class="todo TODO">TODO</span> Close a message</a>
<ul>
<li><a href="#sec-5-3-1">5.3.1. If clocking this message,</a></li>
<li><a href="#sec-5-3-2">5.3.2. If not clocking for some reason</a></li>
</ul>
</li>
<li><a href="#sec-5-4">5.4. <span class="todo TODO">TODO</span> Reply to a message</a>
<ul>
<li><a href="#sec-5-4-1">5.4.1. Create an org-entry for the reply</a></li>
<li><a href="#sec-5-4-2">5.4.2. If adding contacts</a></li>
</ul>
</li>
<li><a href="#sec-5-5">5.5. <span class="todo TODO">TODO</span> Send Reply</a>
<ul>
<li><a href="#sec-5-5-1">5.5.1. Check to,cc,bcc contacts</a></li>
<li><a href="#sec-5-5-2">5.5.2. Get message ID from server and replace temporary ID with that ID</a></li>
<li><a href="#sec-5-5-3">5.5.3. Stop clocking</a></li>
</ul>
</li>
<li><a href="#sec-5-6">5.6. <span class="todo TODO">TODO</span> Close reply without sending</a>
<ul>
<li><a href="#sec-5-6-1">5.6.1. stop clocking</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-6">6. Capture</a>
<ul>
<li><a href="#sec-6-1">6.1. Adding/Capturing Objects</a></li>
<li><a href="#sec-6-2">6.2. Archiving Objects</a>
<ul>
<li><a href="#sec-6-2-1">6.2.1. Projects</a></li>
<li><a href="#sec-6-2-2">6.2.2. Tasks</a></li>
<li><a href="#sec-6-2-3">6.2.3. Events</a></li>
</ul>
</li>
<li><a href="#sec-6-3">6.3. Workflow</a>
<ul>
<li><a href="#sec-6-3-1">6.3.1. <span class="todo TODO">TODO</span> prompt for TODO Item</a></li>
<li><a href="#sec-6-3-2">6.3.2. <span class="todo TODO">TODO</span> Create entry</a></li>
<li><a href="#sec-6-3-3">6.3.3. <span class="todo TODO">TODO</span> prompt for project</a></li>
<li><a href="#sec-6-3-4">6.3.4. <span class="todo TODO">TODO</span> If capture requires a "with" entry</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-7">7. Contacts</a>
<ul>
<li><a href="#sec-7-1">7.1. Helm Search for contacts</a>
<ul>
<li><a href="#sec-7-1-1">7.1.1. <span class="todo TODO">TODO</span> How do I use helm in capture templates</a></li>
</ul>
</li>
<li><a href="#sec-7-2">7.2. <span class="todo TODO">TODO</span> Contacts tagged with projects and teams that they are involved in</a></li>
<li><a href="#sec-7-3">7.3. <span class="todo TODO">TODO</span> contacts with "encrypt" category force encryption of messages sent to them</a></li>
</ul>
</li>
</ul>
</div>
</div>
---
layout: post
title: Automating my projects with org-mode
excerpt:
---
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Colors</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defvar org-todo-colors-status-future "MediumSpringGreen")
(defvar org-todo-colors-status-current "DarkOrange1")
(defvar org-todo-colors-status-upcoming "DarkGoldenrod1")
(defvar org-todo-colors-status-urgent "red1")
(defvar org-todo-colors-status-completed "DarkTurquoise")
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Projects</h2>
<div class="outline-text-2" id="text-2">
<p>
Properties are the core object of my time-tracking system. They are how I organize what I can track time against and do billing with. <del>Unlike other org systems I want to keep my tasks seperate from my top-level project headers. This will allow me to cleanly seperate my projects from a variety of task files that relate to them.</del>
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Project File</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Projects should be stored somewhere. I am going to store them in a central file.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(defvar org-project-project-file (true-filename "~/.org/projects.org"))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><a id="the-UUID-of-an-object" name="the-UUID-of-an-object"></a><span class="section-number-3">2.2</span> Project Properties</h3>
<div class="outline-text-3" id="text-2-2">
<pre class="example">
*** Project Template
   :PROPERTIES:
   :BILLABLE: (t/f) if the project is billable
   :PERCENT: percent of billable time to use
   :CATEGORY: the major project code to be used for billing purposes
   :START_DATE: start date of project
   :END_DATE: end date of project (when to remove from clocking percent
   :GLOSSARY: The glossary of the key terms of the project for tagging notes and links
   :ID:  the UUID of an object
   :END:
</pre>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(defvar org-project-project-template
"* %^{Project Stage|ONGOING|IDEA|GLIMMER|CAPTURE|LIVE|KICKOFF|STARTUP|ACTIVE|CLOSEOUT|DONE|CANCELED} %?
:CONTACTS:\n:END:
:LOGBOOK:
- State \"CREATED\"       from \"NONE\"       %U
:END:
:PROPERTIES:
:BILLABLE: %^{Billable?|y|n}
:PERCENT: %^{Percent of Time}
:CATEGORY: %^{Project Category}
:START_DATE:
:END_DATE:
:GLOSSARY:
:ID: %(org-id-uuid)
:TYPE: project
:END:"
"Project Template for org-project")
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-todo-keyword-faces
      (append org-todo-keyword-faces
              '(("ONGOING" :foreground org-todo-colors-status-current)
                ("IDEA" :foreground org-todo-colors-status-future)
                ("GLIMMER" :foreground org-todo-colors-status-future)
                ("CAPTURE" :foreground org-todo-colors-status-upcoming :weight bold)
                ("LIVE" :foreground org-todo-colors-status-upcoming :weight bold)
                ("KICKOFF" :foreground org-todo-colors-status-urgent :weight bold)
                ("STARTUP" :foreground org-todo-colors-status-current :weight bold)
                ("ACTIVE" :foreground org-todo-colors-status-current :weight bold)
                ("CLOSEOUT" :foreground org-todo-colors-status-urgent :weight bold)
                ("DONE" :foreground org-todo-colors-status-completed)
                ("CANCELED" :foreground org-todo-colors-status-completed))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Project States</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Projects follow a basic set of project stages so that I can keep track of the progression of a project in the future.
</p>
<ul class="org-ul">
<li>Ongoing: These are projects that never end. Like fund-raising, administration, etc.
</li>
<li>Idea: This state is saved for ideas for projects that have not yet gelled into full projects, and have no identified funding opportunity.
</li>
<li>Glimmer: These are projects that have are more fleshed out, but only have a possible future funding line identified.
</li>
<li>Capture: These are projects that have an
</li>
<li>Live: When a RFP has dropped and we are exploring the project.
</li>
<li>Kickoff:
</li>
<li>Startup: The actual start up of the project once funding has been received.
</li>
<li>Active: The actual project management portion of the project.
</li>
<li>Closeout: The closeout of the project and sunsetting of technical componenets.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'org-todo-keywords
             '(sequence "ONGOING" "IDEA(!)" "GLIMMER(!)" "CAPTURE(!)" "LIVE(!)" "KICKOFF(!)" "STARTUP(!)" "ACTIVE(!)" "CLOSEOUT(!)" "|" "DONE(d!)" "CANCELED(@!)"))
</pre>
</div>
</div>
</div>
