org/projects/project-based-org-clocking.org
** TODO Identifying active projects
#+BEGIN_SRC emacs-lisp
  (defun org-projects-get-projects-all ()
    (org-map-entries (nth 4 (org-heading-components)) t '(org-project-project-file)))

;; A helm source for my projects
;; http://kitchingroup.cheme.cmu.edu/blog/2015/01/24/Anatomy-of-a-helm-source/

  (defun prompt-for-current-projects ()
    (helm :sources '(org-projects-helm-source-current-projects)))

  (defun org-projects-get-projects-current ()
    (org-map-entries (nth 4 (org-heading-components)) "TODO=ACTIVE|TODO=STARTUP|TODO=CLOSEOUT|TODO=ONGOING" '(org-project-project-file)))

  (setq org-projects-helm-source-current-projects
        '((name . "Get current projects using helm.")
          (candidates . org-projects-get-projects-current)
          (action . (lambda (candidate)
                      candidate))))


  (defun prompt-for-current-projects-category ()
    (helm :sources '(org-projects-helm-source-current-projects-category))))

  (defun org-projects-get-project-category-current ()
    (org-map-entries '(let ((category (org-entry-get (point) "CATEGORY"))
                            (name (nth 4 (org-heading-components))))
                        (cons name category)) "TODO=ACTIVE|TODO=STARTUP|TODO=CLOSEOUT|TODO=ONGOING" '(org-project-project-file)))

  (setq org-projects-helm-source-current-projects-category
        '((name . "Get current projects using helm.")
          (candidates . org-projects-get-project-category-current)
          (action . (lambda (candidate)
                      candidate))))

#+END_SRC

** TODO Project directories and projectile
* Tasks
** Task File
Tasks should be stored seperate from projects

#+BEGIN_SRC emacs-lisp
(defvar org-project-tasks-file (true-filename "~/.org/tasks.org"))
#+END_SRC

** Task helpers

** Types of tasks
#+BEGIN_EXAMPLE
 *** TODO
    SCHEDULED: <2015-06-19 Fri> DEADLINE: <2015-06-19 Fri>
    :PROPERTIES:
    :CATEGORY: the major project code to be used for billing purposes
    :ID:  the UUID of an object
    :WITH:
    :AT:
    :EFFORT:
    :STATUS:
    :TYPE:
    :STAGE: The stage of the project to activate this task if it is to be delayed.
    :END:
 *** ACTIVE
    SCHEDULED: <2015-06-19 Fri> DEADLINE: <2015-06-19 Fri>
    :PROPERTIES:
    :CATEGORY: the major project code to be used for billing purposes
    :ID:  the UUID of an object
    :WITH:
    :AT:
    :EFFORT:
    :STATUS:
    :TYPE:
    :END:
 *** CLOSED
    SCHEDULED: <2015-06-19 Fri> DEADLINE: <2015-06-19 Fri>
    :PROPERTIES:
    :CATEGORY: the major project code to be used for billing purposes
    :ID:  the UUID of an object
    :WITH:
    :AT:
    :EFFORT:
    :STATUS:
    :TYPE:
    :END:
 *** WAIT
    :PROPERTIES:
    :CATEGORY: the major project code to be used for billing purposes
    :ID:  the UUID of an object
    :WITH:
    :AT:
    :EFFORT:
    :STATUS:
    :TYPE:
    :END:
#+END_EXAMPLE

Task capture  templates
#+BEGIN_SRC emacs-lisp
  (defvar org-project-task-template-todo
  "* TODO %?
  :LOGBOOK:
  - State \"CREATED\"       from \"NONE\"       %U
  :END:
  :PROPERTIES:
  :CATEGORY: %(prompt-for-current-projects-category)
  :EFFORT: %^{effort|1:00|0:05|0:15|0:30|2:00|4:00}
  :ID: %(org-id-uuid)
  :ASSIGNED:
  :IMPORTANCE:
  :URGENCY:
  :WITH: %(org-projects-helm-contacts-source)
  :AT:
  :STATE: todo
  :TYPE: task
  :END:"
  "TODO Template for org-project")

  (defvar org-project-task-template-active
  "* ACTIVE %?
  :LOGBOOK:
  - State \"CREATED\"       from \"NONE\"       %U
  :END:
  :PROPERTIES:
  :CATEGORY: %(prompt-for-current-projects-category)
  :EFFORT: %^{effort|1:00|0:05|0:15|0:30|2:00|4:00}
  :ID: %(org-id-uuid)
  :ASSIGNED:
  :IMPORTANCE:
  :URGENCY:
  :WITH: %(org-projects-helm-contacts-source)
  :AT:
  :STATUS: active
  :TYPE:
  :END:"
  "ACTIVE Template for org-project")

  (defvar org-project-task-template-contact
  "* CONTACT RE: %?
  :LOGBOOK:
  - State \"CREATED\"       from \"NONE\"       %U
  :END:
  :PROPERTIES:
  :CATEGORY: %(prompt-for-current-projects-category)
  :EFFORT: %^{effort|1:00|0:05|0:15|0:30|2:00|4:00}
  :ID: %(org-id-uuid)
  :IMPORTANCE:
  :URGENCY:
  :WHO: %(org-project-helm-prompt-for-org-contact)
  :STATUS: active
  :TYPE: task
  :END:"
  "CONTACT Template for org-project")

  (defvar org-project-task-template-wait
  "* WAIT RE: %?
  :LOGBOOK:
  - State \"CREATED\"       from \"NONE\"       %U
  :END:
  :PROPERTIES:
  :CATEGORY: %(prompt-for-current-projects-category)
  :ID: %(org-id-uuid)
  :IMPORTANCE:
  :URGENCY:
  :FROM: %(org-project-helm-prompt-for-org-contact)
  :STATUS: active
  :TYPE: task
  :END:"
  "WAIT Template for org-project")

  (defvar org-project-task-template-closed
  "* %^{STATUS|DONE|SOMEDAY|CANCELED|FAILED} %?
  :PROPERTIES:
  :CATEGORY: %(prompt-for-current-projects-category)
  :EFFORT: %^{effort|1:00|0:05|0:15|0:30|2:00|4:00}
  :ID: %(org-id-uuid)
  :ASSIGNED:
  :IMPORTANCE:
  :URGENCY:
  :AT:
  :STATUS: closed
  :TYPE: task
  :END:"
  "CLOSED Template for org-project")
#+END_SRC
Task faces
#+BEGIN_SRC emacs-lisp
    (setq org-todo-keyword-faces
          (append org-todo-keyword-faces
                  '(("TODO" :foreground org-todo-colors-status-urgent)
                    ("ACTIVE" :foreground org-todo-colors-status-current)
                    ("CONTACT" :foreground org-todo-colors-status-current)
                    ("WAIT" :foreground org-todo-colors-status-upcoming :weight bold)
                    ("DONE" :foreground org-todo-colors-status-completed :weight bold)
                    ("SOMEDAY" :foreground org-todo-colors-status-completed :weight bold)
                    ("CANCELED" :foreground org-todo-colors-status-completed :weight bold)
                    ("FAILED" :foreground org-todo-colors-status-completed :weight bold))))
#+END_SRC

** Task States

*** Basic Tasks
TODO keywords and workflow
#+BEGIN_SRC emacs-lisp
  (add-to-list 'org-todo-keywords
               '(sequence "TODO(t!)" "CONTACT(c!)" "ACTIVE(a!)" "WAIT(w/!)" "|" "DONE(d!)" "SOMEDAY(s!)" "CANCELED(C!)" "FAILED(f!)"))
#+END_SRC

*** Updating a tasks status when states change

This is how I ensure that my status objects are updated

#+BEGIN_SRC emacs-lisp

  (setq org-project-task-states
        '(("active" . ("ACTIVE" "WAIT" "REPLY"))
         ("todo" . ("TODO" "CONTACT"))
         ("closed" . ("FAILED" "CANCELED" "SOMEDAY" "DONE"))))

  (defun org-project-task-update-status-on-todo-changes ()
    "Update the state property for a task to represent complex states.
     Hook function for 'org-after-todo-state-change-hook'
     Check the org-project-task-states to see if the current state is one that"
    (if (equal (org-entry-get (point) "TYPE") "task")
    (let ((check-states org-project-task-states))
      (while check-states
        (let ((cur-state (car check-states)))
          (if (member org-state (cdr cur-state))
              (org-entry-put (point) "STATUS" (car cur-state))))
          (setq check-states (cdr check-states))))))

  (add-hook 'org-after-todo-state-change-hook
            'org-project-task-update-status-on-todo-changes)
#+END_SRC

* Events

** Events File
Task File
Tasks should be stored seperate from projects

#+BEGIN_SRC emacs-lisp
(defvar org-project-tasks-file (true-filename "~/.org/tasks.org"))
#+END_SRC

