all/projects/_posts/project-based-org-clocking.html

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> <span class="todo TODO">TODO</span> Identifying active projects</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">  (defun org-projects-get-projects-all ()
    (org-map-entries (nth 4 (org-heading-components)) t '(org-project-project-file)))

;; A helm source for my projects
;; http://kitchingroup.cheme.cmu.edu/blog/2015/01/24/Anatomy-of-a-helm-source/

  (defun prompt-for-current-projects ()
    (helm :sources '(org-projects-helm-source-current-projects)))

  (defun org-projects-get-projects-current ()
    (org-map-entries (nth 4 (org-heading-components)) "TODO=ACTIVE|TODO=STARTUP|TODO=CLOSEOUT|TODO=ONGOING" '(org-project-project-file)))

  (setq org-projects-helm-source-current-projects
        '((name . "Get current projects using helm.")
          (candidates . org-projects-get-projects-current)
          (action . (lambda (candidate)
                      candidate))))


  (defun prompt-for-current-projects-category ()
    (helm :sources '(org-projects-helm-source-current-projects-category))))

  (defun org-projects-get-project-category-current ()
    (org-map-entries '(let ((category (org-entry-get (point) "CATEGORY"))
                            (name (nth 4 (org-heading-components))))
                        (cons name category)) "TODO=ACTIVE|TODO=STARTUP|TODO=CLOSEOUT|TODO=ONGOING" '(org-project-project-file)))

  (setq org-projects-helm-source-current-projects-category
        '((name . "Get current projects using helm.")
          (candidates . org-projects-get-project-category-current)
          (action . (lambda (candidate)
                      candidate))))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> <span class="todo TODO">TODO</span> Project directories and projectile</h3>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Tasks</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Task File</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Tasks should be stored seperate from projects
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(defvar org-project-tasks-file (true-filename "~/.org/tasks.org"))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Task helpers</h3>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><a id="the-UUID-of-an-object" name="the-UUID-of-an-object"></a><span class="section-number-3">3.3</span> Types of tasks</h3>
<div class="outline-text-3" id="text-3-3">
<pre class="example">
*** TODO
   SCHEDULED: &lt;2015-06-19 Fri&gt; DEADLINE: &lt;2015-06-19 Fri&gt;
   :PROPERTIES:
   :CATEGORY: the major project code to be used for billing purposes
   :ID:  the UUID of an object
   :WITH:
   :AT:
   :EFFORT:
   :STATUS:
   :TYPE:
   :STAGE: The stage of the project to activate this task if it is to be delayed.
   :END:
*** ACTIVE
   SCHEDULED: &lt;2015-06-19 Fri&gt; DEADLINE: &lt;2015-06-19 Fri&gt;
   :PROPERTIES:
   :CATEGORY: the major project code to be used for billing purposes
   :ID:  the UUID of an object
   :WITH:
   :AT:
   :EFFORT:
   :STATUS:
   :TYPE:
   :END:
*** CLOSED
   SCHEDULED: &lt;2015-06-19 Fri&gt; DEADLINE: &lt;2015-06-19 Fri&gt;
   :PROPERTIES:
   :CATEGORY: the major project code to be used for billing purposes
   :ID:  the UUID of an object
   :WITH:
   :AT:
   :EFFORT:
   :STATUS:
   :TYPE:
   :END:
*** WAIT
   :PROPERTIES:
   :CATEGORY: the major project code to be used for billing purposes
   :ID:  the UUID of an object
   :WITH:
   :AT:
   :EFFORT:
   :STATUS:
   :TYPE:
   :END:
</pre>

<p>
Task capture  templates
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defvar org-project-task-template-todo
"* TODO %?
:LOGBOOK:
- State \"CREATED\"       from \"NONE\"       %U
:END:
:PROPERTIES:
:CATEGORY: %(prompt-for-current-projects-category)
:EFFORT: %^{effort|1:00|0:05|0:15|0:30|2:00|4:00}
:ID: %(org-id-uuid)
:ASSIGNED:
:IMPORTANCE:
:URGENCY:
:WITH: %(org-projects-helm-contacts-source)
:AT:
:STATE: todo
:TYPE: task
:END:"
"TODO Template for org-project")

(defvar org-project-task-template-active
"* ACTIVE %?
:LOGBOOK:
- State \"CREATED\"       from \"NONE\"       %U
:END:
:PROPERTIES:
:CATEGORY: %(prompt-for-current-projects-category)
:EFFORT: %^{effort|1:00|0:05|0:15|0:30|2:00|4:00}
:ID: %(org-id-uuid)
:ASSIGNED:
:IMPORTANCE:
:URGENCY:
:WITH: %(org-projects-helm-contacts-source)
:AT:
:STATUS: active
:TYPE:
:END:"
"ACTIVE Template for org-project")

(defvar org-project-task-template-contact
"* CONTACT RE: %?
:LOGBOOK:
- State \"CREATED\"       from \"NONE\"       %U
:END:
:PROPERTIES:
:CATEGORY: %(prompt-for-current-projects-category)
:EFFORT: %^{effort|1:00|0:05|0:15|0:30|2:00|4:00}
:ID: %(org-id-uuid)
:IMPORTANCE:
:URGENCY:
:WHO: %(org-project-helm-prompt-for-org-contact)
:STATUS: active
:TYPE: task
:END:"
"CONTACT Template for org-project")

(defvar org-project-task-template-wait
"* WAIT RE: %?
:LOGBOOK:
- State \"CREATED\"       from \"NONE\"       %U
:END:
:PROPERTIES:
:CATEGORY: %(prompt-for-current-projects-category)
:ID: %(org-id-uuid)
:IMPORTANCE:
:URGENCY:
:FROM: %(org-project-helm-prompt-for-org-contact)
:STATUS: active
:TYPE: task
:END:"
"WAIT Template for org-project")

(defvar org-project-task-template-closed
"* %^{STATUS|DONE|SOMEDAY|CANCELED|FAILED} %?
:PROPERTIES:
:CATEGORY: %(prompt-for-current-projects-category)
:EFFORT: %^{effort|1:00|0:05|0:15|0:30|2:00|4:00}
:ID: %(org-id-uuid)
:ASSIGNED:
:IMPORTANCE:
:URGENCY:
:AT:
:STATUS: closed
:TYPE: task
:END:"
"CLOSED Template for org-project")
</pre>
</div>
<p>
Task faces
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-todo-keyword-faces
      (append org-todo-keyword-faces
              '(("TODO" :foreground org-todo-colors-status-urgent)
                ("ACTIVE" :foreground org-todo-colors-status-current)
                ("CONTACT" :foreground org-todo-colors-status-current)
                ("WAIT" :foreground org-todo-colors-status-upcoming :weight bold)
                ("DONE" :foreground org-todo-colors-status-completed :weight bold)
                ("SOMEDAY" :foreground org-todo-colors-status-completed :weight bold)
                ("CANCELED" :foreground org-todo-colors-status-completed :weight bold)
                ("FAILED" :foreground org-todo-colors-status-completed :weight bold))))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Task States</h3>
<div class="outline-text-3" id="text-3-4">
</div><div id="outline-container-sec-3-4-1" class="outline-4">
<h4 id="sec-3-4-1"><span class="section-number-4">3.4.1</span> Basic Tasks</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
TODO keywords and workflow
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'org-todo-keywords
             '(sequence "TODO(t!)" "CONTACT(c!)" "ACTIVE(a!)" "WAIT(w/!)" "|" "DONE(d!)" "SOMEDAY(s!)" "CANCELED(C!)" "FAILED(f!)"))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-4-2" class="outline-4">
<h4 id="sec-3-4-2"><span class="section-number-4">3.4.2</span> Updating a tasks status when states change</h4>
<div class="outline-text-4" id="text-3-4-2">
<p>
This is how I ensure that my status objects are updated
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-project-task-states
      '(("active" . ("ACTIVE" "WAIT" "REPLY"))
       ("todo" . ("TODO" "CONTACT"))
       ("closed" . ("FAILED" "CANCELED" "SOMEDAY" "DONE"))))

(defun org-project-task-update-status-on-todo-changes ()
  "Update the state property for a task to represent complex states.
   Hook function for 'org-after-todo-state-change-hook'
   Check the org-project-task-states to see if the current state is one that"
  (if (equal (org-entry-get (point) "TYPE") "task")
  (let ((check-states org-project-task-states))
    (while check-states
      (let ((cur-state (car check-states)))
        (if (member org-state (cdr cur-state))
            (org-entry-put (point) "STATUS" (car cur-state))))
        (setq check-states (cdr check-states))))))

(add-hook 'org-after-todo-state-change-hook
          'org-project-task-update-status-on-todo-changes)
</pre>
</div>
</div>
</div>
</div>
</div>
