org/projects/project-based-org-clocking.org
** Event Properties
#+BEGIN_EXAMPLE
 *** EVENT
    :PROPERTIES:
    :CATEGORY: the major project code to be used for billing purposes
    :ID:  the UUID of an object
    :WITH:
    :AT:
    :EFFORT:
    :STATUS:
    :TYPE:
    :END:
 *** MEET about TASK
    :PROPERTIES:
    :CATEGORY: the major project code to be used for billing purposes
    :ID:  the UUID of an object
    :WITH: [CONTACT(s)]
    :AT:
    :EFFORT:
    :STATUS:
    :TYPE:
    :END:
#+END_EXAMPLE

#+BEGIN_SRC emacs-lisp
  (defvar org-project-task-template-meet
  "* MEET about %?
  :PROPERTIES:
  :CATEGORY: %(prompt-for-current-projects-category)
  :EFFORT: %^{effort|1:00|0:05|0:15|0:30|2:00|4:00}
  :ID: %(org-id-uuid)
  :ASSIGNED:
  :IMPORTANCE:
  :URGENCY:
  :WITH: %(org-project-helm-prompt-for-org-contact)
  :STATUS: active
  :TYPE: event
  :END:"
  "Task Template for org-project")

  (defvar org-project-task-template-event
  "* EVENT
   SCHEDULED:  %^t
  :PROPERTIES:
  :CATEGORY: %(prompt-for-current-projects-category)
  :EFFORT: %^{effort|1:00|0:05|0:15|0:30|2:00|4:00}
  :ID: %(org-id-uuid)
  :ASSIGNED:
  :IMPORTANCE:
  :URGENCY:
  :WITH: %(org-project-helm-prompt-for-org-contact)
  :STATUS: todo
  :TYPE: event
  :END:"
  "Task Template for org-project")
#+END_SRC

#+BEGIN_SRC emacs-lisp
      (setq org-todo-keyword-faces
            (append org-todo-keyword-faces
                    '(("EVENT" :foreground org-todo-colors-status-upcoming :weight bold)
                      ("MEET" :foreground org-todo-colors-status-current))))
#+END_SRC

* Email
** TODO Received new message
*** If encrypted
**** decrypt for parsing
*** get projects
**** get project glossaries
***** check content and subject for terms
***** tag to project if found
**** check from, cc & to for group memebers
***** tag to project if found
** TODO Open a message
*** Create an org entry of the email
*** Add project category to entry from message tag
*** Start clocking to the message
*** Create global variable of message that was opened (so that when we stop clocking we don't have to query the original message that opened the thread)
*** decrypt message
** TODO Close a message
*** If clocking this message,
**** Stop clocking and close the message.
*** If not clocking for some reason
**** Close the message without closing current clock
** TODO Reply to a message
*** Create an org-entry for the reply
**** Add project category to entry from message tag
**** Temporary ID created and stored in global value list
*** If adding contacts
**** helm-contacts uses tags and members of the thread to give a sub-list of probable contacts
** TODO Send Reply
*** Check to,cc,bcc contacts
**** If contact in to,cc,or bcc requires encryption
***** Encrypt message
*** Get message ID from server and replace temporary ID with that ID
*** Stop clocking
** TODO Close reply without sending
*** stop clocking
* Capture
** Adding/Capturing Objects
#+BEGIN_SRC emacs-lisp
  (setq org-capture-templates
        `(("p" "Projects")
          ("pc" "Create Project" entry (file org-project-project-file)
            ,org-project-project-template :clock-in t :clock-resume t)
          ("t" "Tasks")
          ("tt" "Create TODO" entry (file org-project-tasks-file)
            ,org-project-task-template-todo :clock-in t :clock-resume t)
          ("ta" "Create ACTIVE" entry (file org-project-tasks-file)
            ,org-project-task-template-active :clock-in t :clock-resume t)
          ("tc" "Create CONTACT" entry (file org-project-tasks-file)
            ,org-project-task-template-contact :clock-in t :clock-resume t)
          ("tw" "Create WAIT" entry (file org-project-tasks-file)
            ,org-project-task-template-wait :clock-in t :clock-resume t)
          ("tC" "Create Closed" entry (file org-project-tasks-file)
            ,org-project-task-template-closed :clock-in t :clock-resume t)
          ("e" "Events")
          ("ee" "Create EVENT" entry (file org-project-events-file)
            ,org-project-task-template-event :clock-in t :clock-resume t)
          ("em" "Create MEETING" entry (file org-project-events-file)
            ,org-project-task-template-meet :clock-in t :clock-resume t)))
#+END_SRC
** Archiving Objects
*** Projects
*** Tasks
*** Events
** Workflow
*** TODO prompt for TODO Item
*** TODO Create entry
*** TODO prompt for project
**** TODO Add project category to entry
