all/projects/_posts/project-based-org-clocking.html

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Events</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Events File</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Task File
Tasks should be stored seperate from projects
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(defvar org-project-tasks-file (true-filename "~/.org/tasks.org"))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><a id="the-UUID-of-an-object" name="the-UUID-of-an-object"></a><span class="section-number-3">4.2</span> Event Properties</h3>
<div class="outline-text-3" id="text-4-2">
<pre class="example">
*** EVENT
   :PROPERTIES:
   :CATEGORY: the major project code to be used for billing purposes
   :ID:  the UUID of an object
   :WITH:
   :AT:
   :EFFORT:
   :STATUS:
   :TYPE:
   :END:
*** MEET about TASK
   :PROPERTIES:
   :CATEGORY: the major project code to be used for billing purposes
   :ID:  the UUID of an object
   :WITH: [CONTACT(s)]
   :AT:
   :EFFORT:
   :STATUS:
   :TYPE:
   :END:
</pre>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(defvar org-project-task-template-meet
"* MEET about %?
:PROPERTIES:
:CATEGORY: %(prompt-for-current-projects-category)
:EFFORT: %^{effort|1:00|0:05|0:15|0:30|2:00|4:00}
:ID: %(org-id-uuid)
:ASSIGNED:
:IMPORTANCE:
:URGENCY:
:WITH: %(org-project-helm-prompt-for-org-contact)
:STATUS: active
:TYPE: event
:END:"
"Task Template for org-project")

(defvar org-project-task-template-event
"* EVENT
 SCHEDULED:  %^t
:PROPERTIES:
:CATEGORY: %(prompt-for-current-projects-category)
:EFFORT: %^{effort|1:00|0:05|0:15|0:30|2:00|4:00}
:ID: %(org-id-uuid)
:ASSIGNED:
:IMPORTANCE:
:URGENCY:
:WITH: %(org-project-helm-prompt-for-org-contact)
:STATUS: todo
:TYPE: event
:END:"
"Task Template for org-project")
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-todo-keyword-faces
      (append org-todo-keyword-faces
              '(("EVENT" :foreground org-todo-colors-status-upcoming :weight bold)
                ("MEET" :foreground org-todo-colors-status-current))))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Email</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> <span class="todo TODO">TODO</span> Received new message</h3>
<div class="outline-text-3" id="text-5-1">
</div><div id="outline-container-sec-5-1-1" class="outline-4">
<h4 id="sec-5-1-1"><span class="section-number-4">5.1.1</span> If encrypted</h4>
<div class="outline-text-4" id="text-5-1-1">
</div><ol class="org-ol"><li><a id="sec-5-1-1-1" name="sec-5-1-1-1"></a>decrypt for parsing<br  /></li></ol>
</div>
<div id="outline-container-sec-5-1-2" class="outline-4">
<h4 id="sec-5-1-2"><span class="section-number-4">5.1.2</span> get projects</h4>
<div class="outline-text-4" id="text-5-1-2">
</div><ol class="org-ol"><li><a id="sec-5-1-2-1" name="sec-5-1-2-1"></a>get project glossaries<br  /><ol class="org-ol"><li><a id="sec-5-1-2-1-1" name="sec-5-1-2-1-1"></a>check content and subject for terms<br  /></li>
<li><a id="sec-5-1-2-1-2" name="sec-5-1-2-1-2"></a>tag to project if found<br  /></li></ol>
</li>
<li><a id="sec-5-1-2-2" name="sec-5-1-2-2"></a>check from, cc &amp; to for group memebers<br  /><ol class="org-ol"><li><a id="sec-5-1-2-2-1" name="sec-5-1-2-2-1"></a>tag to project if found<br  /></li></ol>
</li></ol>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> <span class="todo TODO">TODO</span> Open a message</h3>
<div class="outline-text-3" id="text-5-2">
</div><div id="outline-container-sec-5-2-1" class="outline-4">
<h4 id="sec-5-2-1"><span class="section-number-4">5.2.1</span> Create an org entry of the email</h4>
</div>
<div id="outline-container-sec-5-2-2" class="outline-4">
<h4 id="sec-5-2-2"><span class="section-number-4">5.2.2</span> Add project category to entry from message tag</h4>
</div>
<div id="outline-container-sec-5-2-3" class="outline-4">
<h4 id="sec-5-2-3"><span class="section-number-4">5.2.3</span> Start clocking to the message</h4>
</div>
<div id="outline-container-sec-5-2-4" class="outline-4">
<h4 id="sec-5-2-4"><span class="section-number-4">5.2.4</span> Create global variable of message that was opened (so that when we stop clocking we don't have to query the original message that opened the thread)</h4>
</div>
<div id="outline-container-sec-5-2-5" class="outline-4">
<h4 id="sec-5-2-5"><span class="section-number-4">5.2.5</span> decrypt message</h4>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> <span class="todo TODO">TODO</span> Close a message</h3>
<div class="outline-text-3" id="text-5-3">
</div><div id="outline-container-sec-5-3-1" class="outline-4">
<h4 id="sec-5-3-1"><span class="section-number-4">5.3.1</span> If clocking this message,</h4>
<div class="outline-text-4" id="text-5-3-1">
</div><ol class="org-ol"><li><a id="sec-5-3-1-1" name="sec-5-3-1-1"></a>Stop clocking and close the message.<br  /></li></ol>
</div>
<div id="outline-container-sec-5-3-2" class="outline-4">
<h4 id="sec-5-3-2"><span class="section-number-4">5.3.2</span> If not clocking for some reason</h4>
<div class="outline-text-4" id="text-5-3-2">
</div><ol class="org-ol"><li><a id="sec-5-3-2-1" name="sec-5-3-2-1"></a>Close the message without closing current clock<br  /></li></ol>
</div>
</div>
<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> <span class="todo TODO">TODO</span> Reply to a message</h3>
<div class="outline-text-3" id="text-5-4">
</div><div id="outline-container-sec-5-4-1" class="outline-4">
<h4 id="sec-5-4-1"><span class="section-number-4">5.4.1</span> Create an org-entry for the reply</h4>
<div class="outline-text-4" id="text-5-4-1">
</div><ol class="org-ol"><li><a id="sec-5-4-1-1" name="sec-5-4-1-1"></a>Add project category to entry from message tag<br  /></li>
<li><a id="sec-5-4-1-2" name="sec-5-4-1-2"></a>Temporary ID created and stored in global value list<br  /></li></ol>
</div>
<div id="outline-container-sec-5-4-2" class="outline-4">
<h4 id="sec-5-4-2"><span class="section-number-4">5.4.2</span> If adding contacts</h4>
<div class="outline-text-4" id="text-5-4-2">
</div><ol class="org-ol"><li><a id="sec-5-4-2-1" name="sec-5-4-2-1"></a>helm-contacts uses tags and members of the thread to give a sub-list of probable contacts<br  /></li></ol>
</div>
</div>
<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> <span class="todo TODO">TODO</span> Send Reply</h3>
<div class="outline-text-3" id="text-5-5">
</div><div id="outline-container-sec-5-5-1" class="outline-4">
<h4 id="sec-5-5-1"><span class="section-number-4">5.5.1</span> Check to,cc,bcc contacts</h4>
<div class="outline-text-4" id="text-5-5-1">
</div><ol class="org-ol"><li><a id="sec-5-5-1-1" name="sec-5-5-1-1"></a>If contact in to,cc,or bcc requires encryption<br  /><ol class="org-ol"><li><a id="sec-5-5-1-1-1" name="sec-5-5-1-1-1"></a>Encrypt message<br  /></li></ol>
</li></ol>
</div>
<div id="outline-container-sec-5-5-2" class="outline-4">
<h4 id="sec-5-5-2"><span class="section-number-4">5.5.2</span> Get message ID from server and replace temporary ID with that ID</h4>
</div>
<div id="outline-container-sec-5-5-3" class="outline-4">
<h4 id="sec-5-5-3"><span class="section-number-4">5.5.3</span> Stop clocking</h4>
</div>
</div>
<div id="outline-container-sec-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> <span class="todo TODO">TODO</span> Close reply without sending</h3>
<div class="outline-text-3" id="text-5-6">
</div><div id="outline-container-sec-5-6-1" class="outline-4">
<h4 id="sec-5-6-1"><span class="section-number-4">5.6.1</span> stop clocking</h4>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Capture</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Adding/Capturing Objects</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-capture-templates
      `(("p" "Projects")
        ("pc" "Create Project" entry (file org-project-project-file)
          ,org-project-project-template :clock-in t :clock-resume t)
        ("t" "Tasks")
        ("tt" "Create TODO" entry (file org-project-tasks-file)
          ,org-project-task-template-todo :clock-in t :clock-resume t)
        ("ta" "Create ACTIVE" entry (file org-project-tasks-file)
          ,org-project-task-template-active :clock-in t :clock-resume t)
        ("tc" "Create CONTACT" entry (file org-project-tasks-file)
          ,org-project-task-template-contact :clock-in t :clock-resume t)
        ("tw" "Create WAIT" entry (file org-project-tasks-file)
          ,org-project-task-template-wait :clock-in t :clock-resume t)
        ("tC" "Create Closed" entry (file org-project-tasks-file)
          ,org-project-task-template-closed :clock-in t :clock-resume t)
        ("e" "Events")
        ("ee" "Create EVENT" entry (file org-project-events-file)
          ,org-project-task-template-event :clock-in t :clock-resume t)
        ("em" "Create MEETING" entry (file org-project-events-file)
          ,org-project-task-template-meet :clock-in t :clock-resume t)))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Archiving Objects</h3>
<div class="outline-text-3" id="text-6-2">
</div><div id="outline-container-sec-6-2-1" class="outline-4">
<h4 id="sec-6-2-1"><span class="section-number-4">6.2.1</span> Projects</h4>
</div>
<div id="outline-container-sec-6-2-2" class="outline-4">
<h4 id="sec-6-2-2"><span class="section-number-4">6.2.2</span> Tasks</h4>
</div>
<div id="outline-container-sec-6-2-3" class="outline-4">
<h4 id="sec-6-2-3"><span class="section-number-4">6.2.3</span> Events</h4>
</div>
</div>
<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> Workflow</h3>
<div class="outline-text-3" id="text-6-3">
</div><div id="outline-container-sec-6-3-1" class="outline-4">
<h4 id="sec-6-3-1"><span class="section-number-4">6.3.1</span> <span class="todo TODO">TODO</span> prompt for TODO Item</h4>
</div>
<div id="outline-container-sec-6-3-2" class="outline-4">
<h4 id="sec-6-3-2"><span class="section-number-4">6.3.2</span> <span class="todo TODO">TODO</span> Create entry</h4>
</div>
<div id="outline-container-sec-6-3-3" class="outline-4">
<h4 id="sec-6-3-3"><span class="section-number-4">6.3.3</span> <span class="todo TODO">TODO</span> prompt for project</h4>
<div class="outline-text-4" id="text-6-3-3">
</div><ol class="org-ol"><li><a id="sec-6-3-3-1" name="sec-6-3-3-1"></a><span class="todo TODO">TODO</span> Add project category to entry<br  /></li></ol>
</div>
