org/projects/project-based-org-clocking.org
*** TODO If capture requires a "with" entry
**** create helm-contacts list to choose from
* Contacts
** Helm Search for contacts
This searches the org-contacts file and returns the name of the contact.
#+BEGIN_SRC emacs-lisp
    (defun org-projects-helm-get-contacts ()
      (org-map-entries '(let ((email (org-entry-get (point) "EMAIL"))
                              (name (nth 4 (org-heading-components))))
                          (cons (concat name " ( " email " ) ") name)) t '(org-contacts-files)))

      (setq org-projects-helm-contacts-source
              `((name . "Helm capture for Org-Contacts")
                (candidates . org-projects-helm-get-contacts)
                (action . (lambda (candidate)
                            (mapconcat 'identity (helm-marked-candidates) ", ")))))

      (defun helm-prompt-for-current-org-contact ()
            (interactive)
            (helm :sources '(org-projects-helm-contacts-source)))
#+END_SRC
*** TODO How do I use helm in capture templates
This is just a quick function to remind me that I have to figure out how to use helm in capture templates.
#+BEGIN_SRC emacs-lisp
  (defun org-project-task-template-contacts-test ()
      (interactive)
      (format "* TODO DELETE THIS TEST
    SCHEDULED: %t
    :PROPERTIES:
    :CONTACTS: %s
    :TYPE: test
    :END:" (mapconcat 'identity (prompt-for-current-org-contact) ", ")))

  (defun org-projects-get-clean-contacts-list ()
              (mapconcat 'identity (prompt-for-current-org-contact) ", "))
#+END_SRC

** TODO Contacts tagged with projects and teams that they are involved in
** TODO contacts with "encrypt" category force encryption of messages sent to them
