all/projects/_posts/project-based-org-clocking.html
<div id="outline-container-sec-6-3-4" class="outline-4">
<h4 id="sec-6-3-4"><span class="section-number-4">6.3.4</span> <span class="todo TODO">TODO</span> If capture requires a "with" entry</h4>
<div class="outline-text-4" id="text-6-3-4">
</div><ol class="org-ol"><li><a id="sec-6-3-4-1" name="sec-6-3-4-1"></a>create helm-contacts list to choose from<br  /></li></ol>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Contacts</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Helm Search for contacts</h3>
<div class="outline-text-3" id="text-7-1">
<p>
This searches the org-contacts file and returns the name of the contact.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun org-projects-helm-get-contacts ()
  (org-map-entries '(let ((email (org-entry-get (point) "EMAIL"))
                          (name (nth 4 (org-heading-components))))
                      (cons (concat name " ( " email " ) ") name)) t '(org-contacts-files)))

  (setq org-projects-helm-contacts-source
          `((name . "Helm capture for Org-Contacts")
            (candidates . org-projects-helm-get-contacts)
            (action . (lambda (candidate)
                        (mapconcat 'identity (helm-marked-candidates) ", ")))))

  (defun helm-prompt-for-current-org-contact ()
        (interactive)
        (helm :sources '(org-projects-helm-contacts-source)))
</pre>
</div>
</div>
<div id="outline-container-sec-7-1-1" class="outline-4">
<h4 id="sec-7-1-1"><span class="section-number-4">7.1.1</span> <span class="todo TODO">TODO</span> How do I use helm in capture templates</h4>
<div class="outline-text-4" id="text-7-1-1">
<p>
This is just a quick function to remind me that I have to figure out how to use helm in capture templates.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(defun org-project-task-template-contacts-test ()
    (interactive)
    (format "* TODO DELETE THIS TEST
  SCHEDULED: %t
  :PROPERTIES:
  :CONTACTS: %s
  :TYPE: test
  :END:" (mapconcat 'identity (prompt-for-current-org-contact) ", ")))

(defun org-projects-get-clean-contacts-list ()
            (mapconcat 'identity (prompt-for-current-org-contact) ", "))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> <span class="todo TODO">TODO</span> Contacts tagged with projects and teams that they are involved in</h3>
</div>
<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> <span class="todo TODO">TODO</span> contacts with "encrypt" category force encryption of messages sent to them</h3>
</div>
</div>
